
class TermsText{
  String mainTitle = '연구과제 참여, 개인정보활용 및 상담동의서';
  String allTitle = '모든 약관 동의';

  String participationTitle = '연구 참여 동의';
  String participation = '연구과제명 : 건강한 노동력에 기초한 기업과 국가의 경쟁력 제고를 위한 AI기반의 비대면 직장인 리질리언스 강화 서비스 개발\n\n'+
  '본 연구는 직장인의 리질리언스(회복탄력성) 강화를 위한 AI 기반의 비대면 서비스 개발에 대한 연구입니다. 본 연구에 참여하기에 앞서 설명문과 동의서를 읽어보시고 연구 참여 여부를 자발적으로 결정하실 수 있습니다. '
      '만일 결정에 앞서 어떠한 질문이 있다면 연구원에게 문의하셔서 결정하실 수 있습니다. '
      '귀하의 서명은 귀하가 본 연구에 관한  설명을 들었음을 의미하며, 이 문서에 대한 귀하의 서명은 귀하께서 본 연구에 참가를 원한다는 것을 의미합니다.\n\n'+
      '1. 연구의 배경과 목적\n'+
      '본 연구는 기존의 직장인 심리지원 서비스(EAP, 대면상담)의 한계, 코로나 팬데믹에 따른 언택트 서비스가 요구되는 상황을 배경으로 하고 있습니다. 본 연구를 통해 AI 기반의 비대면 심리지원 서비스 플랫폼을 개발하여, 직장인 누구나 언제 어디서나 손쉽게 심리지원 받을 수 있도록 하며 리질리언스를 강화할 수 있는 서비스를 제공하고자 합니다. 직원의 건강에 기초한 기업의 생산력 향상과 경쟁력 제고, 나아가 국가 차원에서 정신건강 관리 발전 방안을 모색하는 것을 목표로 하고 있습니다.\n\n'+
      '2. 연구 참여 대상\n'+
      '본 연구에는 만20세 이상 기업 및 영리/비영리 단체에 재직중인 근로자 500~1000명이 참여할 예정입니다.\n\n'+
      '3. 연구 참여방법\n'+
      '만일 귀하가 참여의사를 밝혀 주시면 다음과 같이 진행될 것입니다. 아래 2~5의 과정은 채팅상담앱을 통해 진행됩니다.\n\n'+
      '1. 채팅상담앱 회원가입\n'+
      '2. WSRI(직무 스트레스 반응검사) 검사 실시\n'+
      '3. 상담 가능 시간 입력\n'+
      '4. 상담 시간 확정(전문상담사가 채팅상담앱을 활용하여 연락 예정)\n'+
      '5. WSRI 검사 결과 해석 및 상담 진행\n\n'+
      '4. 연구 참여 기간\n'+
      '귀하는 본 연구를 위해 WSRI 검사(약 5분), 채팅상담에 30분 참여하도록 요청받을 것입니다. 참여에 소요되는 시간은 총 35분으로 예상됩니다.\n\n'+
      '5. 연구 참여자 준수 사항\n'+
      'WSRI 검사 시 떠오르는 대로 솔직하게 응답하여 주시기 바랍니다. 상담사와 약속한 일정에 맞춰 채팅상담 참여하여 주시기 바랍니다.\n\n'+
      '6. 부작용 또는 위험요소\n'+
      '본 연구 수행 중 특별한 위험과 불편감이 예상되지는 않습니다. 연구 참여 도중 어떤 형태로든 부작용이나 위험 요소, 불편감 등에 대한 질문이 있으시면 담당 연구원에게 문의해 주십시오. 연구 수행 중 중단을 원하시면 언제든 중단 의사를 밝혀주신 후 그만둘 수 있습니다.\n\n'+
      '7. 연구 참여에 따른 이익\n'+
      'WSRI 검사를 실시하고 검사결과를 파악한 전문 심리상담사로부터 약 30분간 채팅상담 앱을 통한 심리상담을 제공받게 될 것입니다.연구 참여를 통해 채팅상담을 종료한 경우, 약 3000원 상당의 기프티콘이 지급될 예정입니다. 또한 심리검사 및 심리상담을 통해 자신을 이해하는데 도움이 될 것이며, 사회적으로는 온라인을 통한 심리검사, 상담 서비스를 보편화하고 사람들의 심리건강을 돌보는 데 도움이 될 것입니다.\n\n'+
      '8. 연구에 참여하지 않을 시 불이익\n'+
      '귀하는 본 연구에 참여하지 않을 자유가 있습니다. 또한 귀하가 본 연구에 참여하지 않아도 귀하에게는 어떠한 불이익도 없습니다.\n\n';
  String privacyTitle = '개인정보 수집 및 이용동의';
  String privacyMainText =
  '9. 개인정보와 비밀보장\n'+
      '본 연구기관은 귀하의 개인정보를 중요시하며 “개인정보보호법”을 준수합니다. 개인정보보호법에 따라 귀하가 제공하는 개인정보가 어떠한 목적으로 이용되는지 알려드리고 정보수집·이용에 대한 동의를 받고 있습니다. 귀하는 아래 ‘가’, ‘나’, ‘다’, 항목의 동의를 거부할 수 있으며 ‘가’, ‘나’, ‘다’ 항목에 동의하지 않을 경우 신분이 확인되지 않아 연구 참여(심리검사 및 채팅상담)가 제한될 수 있습니다.\n\n'+
      '가. 개인정보 수집 및 이용목적\n'+
      '1. 수집하는 개인정보 항목 :  개인식별 정보(성명, 성별, 생년), 근무사항(회사명), 연락정보(이메일주소)적\n2. 개인정보의 수집 이용 목적 : * 채팅상담 프로그램 이용자 관리 * 상담예약 및 안내문 발송 * 서비스 만족도조사 및 의견 취합\n3. 개인정보의 보유 및 이용기간 : 수집일로부터 ~2022년 12월\n\n'+
      '나. 민감정보 수집\n'+
      '1. 수집하는 정보 항목 :  WSRI 검사 결과, 채팅상담 내용 일체\n2. 민감정보의 수집 이용 목적 : 직장인의 리질리언스(회복탄력성) 강화를 위한 AI 기반의 비대면 서비스 개발\n3. 민감정보의 보유 및 이용기간 : 수집일로부터 ~2022년 12월 \n*AI기술을 활용한 심리검사/채팅상담 서비스개발 연구기간\n\n'+
      '10. 비밀보장 및 예외 규정\n'+
      '채팅상담에서 진행되는 모든 상담내역 및 상담기록은 비밀보장을 원칙으로 하며, 외부로 유출되지 않습니다. 단, 비밀보장 예외 규정에 속하는 경우, 상담자는 상담신청자의 동의 없이 해당 내용을 관련 기관에 제공할 수 있습니다.(심리상담사 윤리규정에 의거)\n1) 내담자 자신과 타인의 생명, 사회 안전에 위험이 되는 상태라고 판단되는 경우\n2) 내담자가 심각한 학대를 당하고 있을 경우\n3) 법적으로 정보 공개가 요구되는 경우\n\n'+
      '11. 연구 문의\n'+
      '   -연구 담당자 성명: 횡희산 \n   -연구담당자: 김훈 \n   -전화번호: 042-721-2997\n   -연구과제 주관기간(주)온워즈 \n\n하기 본인은 이 동의서를 읽고 이해하였으며 모든 질문에 대한 답변을 들었습니다. 이에 본인은 자발적으로 본 연구에 참여함을 서명으로 확인합니다.\n\n';




}